witsml_models/opsreport.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.witsml.org/wsdl/120" xmlns:types="http://www.witsml.org/wsdl/120/encodedTypes" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <q1:WMLS_AddToStore xmlns:q1="http://www.witsml.org/message/120">
      <WMLtypeIn xsi:type="xsd:string">opsReport</WMLtypeIn>
      <XMLin xsi:type="xsd:string">
        &lt;opsReports xmlns=&quot;http://www.witsml.org/schemas/131&quot; version=&quot;1.3.1.1&quot;&gt;
            &lt;opsReport uidWell=&quot;Altave_Test_Well&quot; uidWellbore=&quot;Altave_Test_Wellbore&quot; uid=&quot;%uidOps&quot;&gt;
                &lt;nameWell&gt;&quot;Altave Test Well&quot;&lt;/nameWell&gt;
                &lt;nameWellbore&gt;&quot;Altave Test Wellbore&quot;&lt;/nameWellbore&gt;
                &lt;name&gt;&quot;%opsName&quot;&lt;/name&gt;
				&lt;dTim&gt;%dTim&lt;/dTim&gt;
                &lt;hse&gt;
			&lt;comments&gt;%comments&lt;/comments&gt;
        &lt;/hse&gt;
            &lt;/opsReport&gt;
        &lt;/opsReports&gt;
      </XMLin>
      <OptionsIn xsi:type="xsd:string"></OptionsIn>
      <CapabilitiesIn xsi:type="xsd:string"></CapabilitiesIn>
    </q1:WMLS_AddToStore>
  </soap:Body>
</soap:Envelope>
