backend/app_django/witsml_models/attachment.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.witsml.org/wsdl/120" xmlns:types="http://www.witsml.org/wsdl/120/encodedTypes" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <q1:WMLS_AddToStore xmlns:q1="http://www.witsml.org/message/120">
      <WMLtypeIn xsi:type="xsd:string">attachment</WMLtypeIn>
      <XMLin xsi:type="xsd:string">
        &lt;attachments xmlns=&quot;http://www.witsml.org/schemas/131&quot; version=&quot;1.3.1.1&quot;&gt;
            &lt;attachment uidWell=&quot;Altave_Test_Well&quot; uidWellbore=&quot;Altave_Test_Wellbore&quot; uid="%uid_attach&quot;&gt;
                &lt;nameWell&gt;&quot;Altave Test Well&quot;&lt;/nameWell&gt;
                &lt;nameWellbore&gt;&quot;Altave Test Wellbore&quot;&lt;/nameWellbore&gt;
                &lt;nameAttachment&gt;&quot;%name_attach&quot;&lt;/nameAttachment&gt;
				&lt;fileName&gt;%filename&lt;/fileName&gt;
                &lt;fileType&gt;image/jpg&lt;/fileType&gt;
                &lt;attachment&gt;%image&lt;/attachment&gt;
            &lt;/attachment&gt;
        &lt;/attachments&gt;
      </XMLin>
      <OptionsIn xsi:type="xsd:string"></OptionsIn>
      <CapabilitiesIn xsi:type="xsd:string"></CapabilitiesIn>
    </q1:WMLS_AddToStore>
  </soap:Body>
</soap:Envelope>