backend/app_django/witsml_models/getcap.xml

<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:tns=\"http://www.witsml.org/wsdl/120\" xmlns:types=\"http://www.witsml.org/wsdl/120/encodedTypes\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body soap:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\n    <q1:WMLS_GetCap xmlns:q1=\"http://www.witsml.org/message/120\">\n      <OptionsIn xsi:type=\"xsd:string\"></OptionsIn>\n    </q1:WMLS_GetCap>\n  </soap:Body>\n</soap:Envelope>